{"config": [{"config": {"trainable": true, "name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>@\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "function_type": "lambda", "input_dtype": "float32", "output_shape_type": "raw", "batch_input_shape": [null, 100, 320, 3]}, "class_name": "Lambda"}, {"config": {"trainable": true, "name": "averagepooling2d_1", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"name": "convolution2d_1", "nb_filter": 5, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "bias": true, "b_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "averagepooling2d_2", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"name": "convolution2d_2", "nb_filter": 15, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "bias": true, "b_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_3", "nb_filter": 20, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "bias": true, "b_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "averagepooling2d_3", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "nb_filter": 25, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "bias": true, "b_constraint": null, "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "b_regularizer": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "output_dim": 200, "activation": "relu", "bias": true, "input_dim": 375, "b_constraint": null, "trainable": true, "W_constraint": null, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 0.0}, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "activation": "linear", "bias": true, "input_dim": 200, "b_constraint": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}