{"keras_version": "1.2.0", "config": [{"config": {"arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape": null, "trainable": true, "batch_input_shape": [null, 100, 320, 3], "function_type": "lambda", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "averagepooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"nb_filter": 10, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "bias": true, "trainable": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_1", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "averagepooling2d_2", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"nb_filter": 30, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "bias": true, "trainable": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_2", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"nb_filter": 60, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "bias": true, "trainable": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_3", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "averagepooling2d_3", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"nb_filter": 120, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "bias": true, "trainable": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "W_constraint": null, "name": "convolution2d_4", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "b_regularizer": null, "bias": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "name": "dense_1", "input_dim": 1800, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 100, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "b_regularizer": null, "bias": true, "W_regularizer": {"l2": 0.0020000000949949026, "l1": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "name": "dense_2", "input_dim": 100, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "input_dim": 100, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}