{"config": [{"config": {"name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>N\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 100, 320, 3], "trainable": true}, "class_name": "Lambda"}, {"config": {"name": "averagepooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"name": "convolution2d_1", "activity_regularizer": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "trainable": true, "border_mode": "valid", "nb_filter": 5, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "averagepooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"name": "convolution2d_2", "activity_regularizer": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "trainable": true, "border_mode": "valid", "nb_filter": 15, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_3", "activity_regularizer": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "trainable": true, "border_mode": "valid", "nb_filter": 20, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "averagepooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "activity_regularizer": null, "activation": "linear", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0010000000474974513}, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 5, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 5, "trainable": true, "border_mode": "valid", "nb_filter": 25, "b_constraint": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "activation": "relu", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": 375, "W_constraint": null, "output_dim": 200, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "input_dim": 200, "W_constraint": null, "output_dim": 1, "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}