{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "batch_input_shape": [null, 100, 320, 3], "input_dtype": "float32", "function_type": "lambda", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>@\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "output_shape_type": "raw"}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_1", "nb_filter": 5, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "nb_row": 5, "b_constraint": null, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "nb_filter": 15, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "nb_row": 5, "b_constraint": null, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_3", "nb_filter": 20, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "nb_row": 5, "b_constraint": null, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_3", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_4", "nb_filter": 25, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "nb_row": 5, "b_constraint": null, "bias": true, "subsample": [1, 1], "dim_ordering": "tf", "W_constraint": null, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "bias": true, "name": "dense_1", "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "b_constraint": null, "output_dim": 200, "input_dim": 375, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.0}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "bias": true, "name": "dense_2", "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "b_constraint": null, "output_dim": 1, "input_dim": 200, "W_regularizer": null, "trainable": true}}]}